grouper-ws/grouper-ws/doc/xmlExamples/getGroupsSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:getGroups xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:subjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:subjectLookup>
      <ns1:memberFilter>All</ns1:memberFilter>
      <ns1:actAsSubjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:actAsSubjectLookup>
    </ns1:getGroups>
  </soapenv:Body>
</soapenv:Envelope>